-- Лабораторна робота №1
-- студента групи КН-32
-- підгрупи 1
-- Бури Максима
-- Варіант №7

--Завдання 1.
--Наведiть приклади виразiв вказаного типу. Кожен список має мiстити кiлька елементiв. Перегляньте тип прикладiв, як їх визначає ghci.
--(String,([Bool],[Integer]))

--a = ("Hello", ([True, 2 > 3], [5]))

-- Завдання 2. Визначте два варiанти вказаних далi функцiй, де аргументи будуть представленi а) як один кортеж, б) без використання кортежiв чи спискiв. 
-- Функцiя приймає два числа i перевiряє, чи вони впорядкованi за зростанням.

first :: (Integer, Integer) -> Bool 
first (x, y) = y >= x

second :: Integer -> Integer -> Bool 
second x y = y >= x