-- Лабораторна робота №1
-- студента групи КН-32
-- підгрупи 1
-- Бури Максима
-- Варіант №6

-- Завдання 1. Наведiть приклади виразiв вказаного типу. 
-- Кожен список має мiстити кiлька елементiв. 
-- Перегляньте тип прикладiв, як їх визначає ghci. Прокоментуйте.
-- [(Integer, (Char,[Bool])]

a ::[(Integer, (Char, [Bool]))] 
a = [(10, ('b',[True, 3==3, False>True])), (-1, ('O',[False, True, False>True]))]

-- Завдання 2.  Визначте два варiанти вказаних далi функцiй. 
-- Перший варiант – з одним аргументом-кортежем, 
-- другий – без використання кортежiв чи спискiв.
-- Функцiя визначає, чи одне коло повнiстю мiститься в iншому. 
-- Кожне коло задається координатами центра та радiусом.

function1 :: (Double, Double, Double, Double, Double, Double) -> Bool 
function1 (x1, y1, r1, x2, y2, r2) = sqrt ((x2-x1)^2 + (y2-y1)^2) <= abs(r1-r2)

function2 :: Double -> Double -> Double-> Double -> Double -> Double -> Bool 
function2 x1 y1 r1 x2 y2 r2 = sqrt ((x2-x1)^2 + (y2-y1)^2) <= abs(r1-r2)